Workspace/test_cases/sod_shock_tube-waveTransmition-pu/system/functionObject1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
(

additional_fields_aposteriori
{
    type writeRegisteredObject;
    functionObjectLibs ( "libIOFunctionObjects.so" );
        
    objectNames ("rho");

    enabled           true;
    outputControl     outputTime;
}

);
